Tekla.Structures.Model.ConicalSurfaceNode
The ConicalSurfaceNode class represents conical surface geometry tree node.

Tekla.Structures.Model.ConicalSurfaceNode.#ctor(Tekla.Structures.Model.ConicalSurface)
Initializes a new instance of the ConicalSurfaceNode class.
surface: The contour of the node.

Tekla.Structures.Model.ConicalSurfaceNode.Surface
Gets the conical surface geometry.

Tekla.Structures.Model.ConicalSurfaceNode.AcceptVisitor(Tekla.Structures.Model.IGeometryNodeVisitor)
Entry method for the visitor pattern.
Remarks:  Does nothing
visitor:

Tekla.Structures.Model.ConicalSurfaceNode.Clone
Creates a new object that is a copy of the current instance.
Returns:  A new object that is a copy of the current instance.